<template>
  <div class="container">
    <img class="img" src="../assets/img/top.jpg" alt="" />
    <h1>«О Компании»</h1>
    <p class="text">
      Сервисный центр "Юг-Фрост" одним из первых на Юге России начал активно работать в области
      автомобильного кондиционирования и транспортного холодильного оборудования. <br /><br />
      Компания основана в 1996 году, а с 2001 года налажено серийное производство холодильного
      оборудования для большинства эксплуатируемых автомобилей в нашей стране. Специалистами нашей
      компании продолжают разрабатываться новые модели оборудования и совершенствоваться
      существующие. Ведется постоянный контроль качества и применяются новые технологии в этой
      области. <br /><br />
      Основой успешной деятельности компании был и остается внимательный подход к каждому клиенту,
      позволяющий решать возникающие вопросы в соответствии с индивидуальными потребностями и
      возможностями.<br /><br />
      Ещё одним важным аспектом успешной работы компании является постоянное развитие и внедрение
      новых технологий в области автомобильного кондиционирования и транспортного холодильного
      оборудования. Это позволяет специалистам сервисного центра «Юг-Фрост» разрабатывать и
      совершенствовать новые модели оборудования, обеспечивая высокое качество продукции и
      удовлетворение потребностей клиентов.
      <br /><br />
      Кроме того, сервисный центр «Юг-Фрост» уделяет большое внимание контролю качества своей
      продукции и стремится соответствовать всем стандартам и требованиям, предъявляемым к
      производителям холодильного оборудования. Это гарантирует надёжность и безопасность
      использования продукции компании, что также способствует успешному развитию бизнеса.
    </p>
    <iframe
      class="frame"
      src="https://yandex.ru/map-widget/v1/?um=constructor%3A5bb505c2360974b73e5d7e36ef3c472247ed51106a75ddc31a894bff089e961c&amp;source=constructor"
      width="791"
      height="650"
      frameborder="0"
    ></iframe>
  </div>
</template>

<script lang="js" setup></script>

<style scoped>
.frame {
  width: 100%;
}
.container {
  margin-top: 50px;
}
.img {
  width: 40%;
  float: left;
  margin-right: 60px;
  border-radius: 10px;
}
.text {
  font-size: 20px;
}
</style>
