<template>
  <div class="container">
    <img class="img" src="../assets/img/top.jpg" alt="" />
    <h1>«О Компании»</h1>
    <p class="text">
      &emsp;Автоспектр — это современный автомагазин, где каждый автолюбитель найдёт всё необходимое
      для своего железного коня. <br />
      &emsp; Мы предлагаем широкий ассортимент автозапчастей, аксессуаров и расходных материалов от
      ведущих мировых производителей.<br />
      &emsp;В нашем магазине вы сможете приобрести: автозапчасти для всех марок и моделей
      автомобилей; аксессуары для салона и кузова; шины и диски; аккумуляторы; автохимию и
      автокосметику; инструменты и оборудование для ремонта и обслуживания автомобилей. <br />&emsp;
      Наши преимущества: широкий ассортимент товаров; высокое качество продукции; доступные цены;
      профессиональные консультации; <br />
      Мы стремимся сделать процесс покупки максимально удобным и приятным для наших клиентов.
      Приходите в Автоспектр и убедитесь в этом сами!
      <br />
      &emsp;Автоспектр — это не просто магазин, это сообщество автолюбителей, объединённых любовью к
      своим машинам. Мы предлагаем не только качественные товары, но и высокий уровень сервиса. Наши
      специалисты всегда готовы помочь вам выбрать нужные запчасти, аксессуары или расходные
      материалы. Они знают всё об автомобилях и с удовольствием делятся своими знаниями с клиентами.
      В Автоспектре вы можете быть уверены в качестве приобретаемых товаров и услуг. Мы работаем
      только с проверенными поставщиками и производителями, чтобы обеспечить нашим клиентам лучший
      сервис и продукцию. Приходите в Автоспектр и убедитесь в этом сами!
    </p>
    <iframe
      class="frame"
      src="https://yandex.ru/map-widget/v1/?um=constructor%3A5519bf4143f86223aa9b9f54ccf886f7559cff7fa8962a562aecffb1d21490fb&amp;source=constructor"
      frameborder="0"
      height="400"
    ></iframe>
  </div>
</template>

<script lang="js" setup></script>

<style scoped>
.frame {
  width: 100%;
}
.container {
  margin-top: 50px;
}
.img {
  width: 40%;
  float: left;
  margin-right: 60px;
  border-radius: 10px;
}
.text {
  font-size: 20px;
}
</style>
